Walkline80/micropython/ports/esp32/boards/WALKLINEHARDWARE/mpconfigboard.h
// Both of these can be set by mpconfigboard.cmake if a BOARD_VARIANT is
// specified.

#define MICROPY_HW_BOARD_NAME "Walkline Hardware ESP32 module"
#define MICROPY_HW_MCU_NAME "ESP32"

#define MODULE_SMARTCONFIG_ENABLED      (1)
#define MODULE_QRCODE_ENABLED           (0)
#define MODULE_FONTLIB_ENABLED          (0)
